# Предприятие производит закупку изделий A и B,
# на которую выделена определённая сумма денег.
# У поставщика есть в наличии различные модификации этих изделий по различной цене.
# При покупке необходимо руководствоваться следующими правилами:
#
# 1. Нужно купить как можно больше изделий, независимо от их типа и модификации.
#
# 2. Если можно разными способами купить максимальное количество изделий,
# нужно выбрать тот способ, при котором будет куплено как можно больше изделий B.
#
# 3. Если можно разными способами купить максимальное количество изделий с
# одинаковым количеством изделий B, нужно выбрать тот способ,
# при котором вся покупка будет дешевле.
#
# Определите, сколько всего будет куплено изделий B и какая сумма останется неиспользованной.

